БухЭксп/InformationRegisters/CW_ПараметрыПланированияДДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ПараметрыПланированияДДС</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПересчитыватьСуммуПриСогласовании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасходыАвтоматическоеПланирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВключатьВнутрихолдинговыеРасходы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасходыСтатьяДДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_СтатьиДДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасходыСтатьяДДСВнутрихолдинг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_СтатьиДДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасходыСценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_СценарииПланированияДДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасходыИнициаторПоЗаявке</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_РеквизитыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШаблонЗаполненияСодержания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_СоответствиеОрганизацийКонтрагентам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_СоответствиеОрганизацийКонтрагентам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ХарактеристикиГрузоперевозок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ХарактеристикиГрузоперевозок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХранилищеДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторВладельца</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Грузоперевозка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ДействующиеМенеджеры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ДействующиеМенеджеры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОфисКомпании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ОфисыКомпании</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ПраваДоступаДляСтатейДДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ПраваДоступаДляСтатейДДС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Использование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ГруппаПользователя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяДДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_СтатьиДДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Enums/CW_ВидыДвиженияДДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ВидыДвиженияДДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Enums/CW_СтатусыПланированияДДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_СтатусыПланированияДДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отклонена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>План</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОплате</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплачено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Catalogs/CW_СтатьиДДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_СтатьиДДС</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидДвижения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВидыДвиженияДДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойВидОперацииПлатежногоПоручения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийСписаниеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяСтатьяДДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/CommonModules/CW_ПланированиеДДС/Ext/Module.bsl
Процедура CW_ПланированиеРасходовДДСОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("CW_ИспользуетсяБлокПланированиеДДС") 
		ИЛИ Не Источник.ПредъявленСчет Тогда
		Возврат;
	КонецЕсли;

	Если БлокировкаАвтогенерацииЗаявокНаОплату(Источник) Тогда  
		Возврат;
	КонецЕсли;
	
	//Параметры планирования
	ПараметрыПланирования = РегистрыСведений.CW_ПараметрыПланированияДДС.ПолучитьПараметрыПланирования(Источник.Организация,Источник.ДатаСчета);
	Если ПараметрыПланирования = Неопределено Тогда 
		Возврат;
	КонецЕсли; 
	
	Если НЕ ПараметрыПланирования.ИспользоватьАвтоматическоеПланирование Тогда
		Возврат;
	КонецЕсли;   
	
	//Исключим внутрихолдинг
	Если Не ПараметрыПланирования.ВключатьВнутрихолдинговыеРасходы Тогда
		КонтрагентВходитВХолдинг = РегистрыСведений.CW_СоответствиеОрганизацийКонтрагентам.КонтрагентВходитВХолдинг(Источник.Контрагент);
		Если КонтрагентВходитВХолдинг Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
		
	СуммаДокумента = Источник.СуммаДокумента - Источник.ЗачетАвансовОЗ.Итог("СуммаЗачета");
	
	Если Не СуммаДокумента > 0 Тогда 
		Возврат;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 	"ВЫБРАТЬ
	               	|	CW_ПланированиеДДС.Ссылка КАК Ссылка
	               	|ИЗ
	               	|	Справочник.CW_ПланированиеДДС КАК CW_ПланированиеДДС
	               	|ГДЕ
	               	|	(ВЫРАЗИТЬ(CW_ПланированиеДДС.ДокументОснование КАК Документ.CW_РасходыПоГрузоперевозке)) = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", Источник.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли; 
	
	ОбъектСтатья					= Справочники.CW_ПланированиеДДС.СоздатьЭлемент();
	ОбъектСтатья.СтатьяДДС			= ПараметрыПланирования.РасходыСтатьяДДС;
	ОбъектСтатья.СрокОплаты			= CW_Документы.ПолучитьСрокОплаты(Источник.Ссылка).ДатаОплаты;
	ОбъектСтатья.Дата				= ТекущаяДата();
	ОбъектСтатья.Автор				= Источник.Ответственный;
	
	Если Источник.Услуги.количество() <> 0 Тогда
		Грузоперевозка = Источник.Услуги[0].Грузоперевозка;
		Если ЗначениеЗаполнено(Грузоперевозка) Тогда
			ИмяРеквизитаИнициатор 	= ОбщегоНазначения.ИмяЗначенияПеречисления(ПараметрыПланирования.РасходыИнициаторПоЗаявке);	
			Инициатор				= Грузоперевозка[ИмяРеквизитаИнициатор];
			ОбъектСтатья.Инициатор	= Инициатор;
			
			Если ПолучитьФункциональнуюОпцию("CW_ИспользованиеОфисовКомпании") Тогда
				ОбъектСтатья.Офис	= ПолучитьОфис(Инициатор);
			КонецЕсли;
			
			Если ПолучитьФункциональнуюОпцию("CW_ИспользованиеПодразделенийКомпании") Тогда
				ОбъектСтатья.Подразделение	= ПолучитьПодразделение(Источник.Ссылка, Инициатор);
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;

	ОбъектСтатья.Сценарий			= ПараметрыПланирования.РасходыСценарий;
	ОбъектСтатья.ВидДвижения		= Перечисления.CW_ВидыДвиженияДДС.Расход;
	ОбъектСтатья.ДокументОснование	= Источник.Ссылка;
	ОбъектСтатья.ОснованиеОплаты	= Источник.ПредставлениеДокумента;
	ОбъектСтатья.Содержание 		= CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПараметрыПланирования.ШаблонЗаполненияСодержания,  Источник.Ссылка, Неопределено, Источник.Ссылка.Услуги);
	
	ОбъектСтатья.ВидОперацииПлатежногоПоручения	= ПараметрыПланирования.ОсновнойВидОперацииПлатежногоПоручения;
	
	СуммаНДСДокумента = Источник.Услуги.Итог("НДС");
	
	Если Источник.Договор.ВзаиморасчетыВУЕ Тогда
		СтруктураКурса = CW_Финансы.ПолучитьКурсВалюты(Источник.Валюта,Источник.ДатаСчета);
		
		ОбъектСтатья.Валюта		= Константы.ВалютаРегламентированногоУчета.Получить();
		ОбъектСтатья.Сумма		= СуммаДокумента * СтруктураКурса.Курс / СтруктураКурса.Кратность;
		ОбъектСтатья.СуммаНДС 	= СуммаНДСДокумента * СтруктураКурса.Курс / СтруктураКурса.Кратность;
	Иначе
		ОбъектСтатья.Валюта	 = Источник.Валюта;
		ОбъектСтатья.Сумма	 = СуммаДокумента;
		ОбъектСтатья.СуммаНДС = СуммаНДСДокумента;
	КонецЕсли; 
	
	
	// заполнение ставки НДС
	ТаблицаУслуг = Источник.Услуги.Выгрузить();
	ТаблицаУслуг.Свернуть("СтавкаНДС", "НДС"); 
	
	мСтавкиНДС = ТаблицаУслуг.ВыгрузитьКолонку("СтавкаНДС");
	
	СуммаНДСПоДокументу = ТаблицаУслуг.Итог("НДС"); 
	Если СуммаНДСПоДокументу = 0 Тогда
		Если мСтавкиНДС.Найти(Перечисления.СтавкиНДС.НДС0)<> Неопределено Тогда
			ОбъектСтатья.СтавкаНДС = Перечисления.СтавкиНДС.НДС0;  
		Иначе
			ОбъектСтатья.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
		КонецЕсли;
	Иначе 
		ИндексНДС0 = мСтавкиНДС.Найти(Перечисления.СтавкиНДС.НДС0);
		Если ИндексНДС0 <> Неопределено Тогда
			мСтавкиНДС.Удалить(ИндексНДС0);
		КонецЕсли;
		ИндексБезНДС = мСтавкиНДС.Найти(Перечисления.СтавкиНДС.БезНДС);
		Если ИндексБезНДС <> Неопределено Тогда
			мСтавкиНДС.Удалить(ИндексБезНДС);
		КонецЕсли;
		
		Если мСтавкиНДС.Количество() = 0 Тогда
			ОбъектСтатья.СтавкаНДС = CW_БухгалтерияЭкспедитораДляРоссииСервер.СтавкаНДСПоВидуСтавки(Перечисления.ВидыСтавокНДС.Общая, Источник.Дата);
		Иначе
			ОбъектСтатья.СтавкаНДС = мСтавкиНДС.Получить(0);
		КонецЕсли;
	КонецЕсли;
	
	

	ЗаполнитьЗначенияСвойств(ОбъектСтатья,Источник,"Организация,Контрагент,Договор");
	
	ОбъектСтатья.Записать();
	
	РегистрыСведений.CW_СтатусыПланированиеДДС.ЗаписатьСтатусВРегистр(ОбъектСтатья.Ссылка, ПредопределенноеЗначение("Перечисление.CW_СтатусыПланированияДДС.План"));

КонецПроцедуры   

Функция БлокировкаАвтогенерацииЗаявокНаОплату(Источник)
	
	ИсточникБлокировки =   Источник.Договор;
	Если ЗначениеЗаполнено(Источник.ПриложениеКДоговору) Тогда
		ИсточникБлокировки = Источник.ПриложениеКДоговору;
	КонецЕсли;
	
	Возврат ИсточникБлокировки.БлокироватьАвтогенерациюЗаявокНаОплату;
	
КонецФункции

Функция ПолучитьПодразделение(Ссылка, Пользователь = Неопределено) Экспорт
	
	Подразделение = Неопределено;
	
	Если Константы.CW_ИспользованиеПодразделенийКомпании.Получить() Тогда
		
		ПараметрПодразделениеКомпании = Константы.CW_ПараметрПодразделениеКомпании.Получить();
		
		Если Не ПараметрПодразделениеКомпании.Пустая() Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст =  "ВЫБРАТЬ ПЕРВЫЕ 1
			                |	МАКСИМУМ(CW_ХарактеристикиГрузоперевозок.Значение) КАК Подразделение
			                |ИЗ
			                |	Документ.CW_РасходыПоГрузоперевозке.Услуги КАК CW_РасходыПоГрузоперевозкеУслуги
			                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.CW_ХарактеристикиГрузоперевозок КАК CW_ХарактеристикиГрузоперевозок
			                |		ПО CW_РасходыПоГрузоперевозкеУслуги.Грузоперевозка = CW_ХарактеристикиГрузоперевозок.Грузоперевозка
			                |ГДЕ
			                |	CW_РасходыПоГрузоперевозкеУслуги.Ссылка = &Ссылка
			                |	И CW_ХарактеристикиГрузоперевозок.Параметр = &Параметр";
			
			Запрос.УстановитьПараметр("Ссылка", 	Ссылка);
			Запрос.УстановитьПараметр("Параметр", 	ПараметрПодразделениеКомпании);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда
				Подразделение =  Выборка.Подразделение;
			КонецЕсли;
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Подразделение) Тогда 
			Если Пользователь = Неопределено Тогда
				Пользователь = ПараметрыСеанса.ТекущийПользователь;
			КонецЕсли;
			
			Подразделение =  ПолучитьПодразделениеМенеджера(Пользователь);
		КонецЕсли; 
		
	КонецЕсли; 
	
	Возврат Подразделение;
	
КонецФункции

Функция ПолучитьПодразделениеМенеджера(Пользователь) Экспорт
	
	Если ТипЗнч(Пользователь) = Тип("СправочникСсылка.Пользователи") Тогда
		Менеджер = Пользователь.ФизическоеЛицо;
	Иначе
		Менеджер = Пользователь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 	"ВЫБРАТЬ
	               	|	CW_ДействующиеМенеджеры.Менеджер КАК Менеджер,
	               	|	CW_ДействующиеМенеджеры.ПодразделениеКомпании КАК ПодразделениеКомпании
	               	|ИЗ
	               	|	РегистрСведений.CW_ДействующиеМенеджеры КАК CW_ДействующиеМенеджеры
	               	|ГДЕ
	               	|	CW_ДействующиеМенеджеры.Менеджер = &Менеджер";
	
	Запрос.УстановитьПараметр("Менеджер", Менеджер);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий(); 
	
	Возврат Выборка.ПодразделениеКомпании
	
КонецФункции

Функция ПолучитьОфис(Пользователь) Экспорт
	
	Если Константы.CW_ИспользованиеОфисовКомпании.Получить() Тогда
		
		Если ТипЗнч(Пользователь) = Тип("СправочникСсылка.Пользователи") Тогда
			Менеджер = Пользователь.ФизическоеЛицо;
		Иначе
			Менеджер = Пользователь;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 	"ВЫБРАТЬ
		|	CW_ДействующиеМенеджеры.Менеджер КАК Менеджер,
		|	CW_ДействующиеМенеджеры.ОфисКомпании КАК ОфисКомпании
		|ИЗ
		|	РегистрСведений.CW_ДействующиеМенеджеры КАК CW_ДействующиеМенеджеры
		|ГДЕ
		|	CW_ДействующиеМенеджеры.Менеджер = &Менеджер";
		
		Запрос.УстановитьПараметр("Менеджер", Менеджер);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий(); 
		
		Возврат Выборка.ОфисКомпании
		
	КонецЕсли; 
	
	Возврат Неопределено;

КонецФункции

Функция ПросмотрСтатейДДС(ГруппаПользователя) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 	"ВЫБРАТЬ
	               	|	CW_ПраваДоступаДляСтатейДДС.СтатьяДДС КАК СтатьяДДС
	               	|ИЗ
	               	|	РегистрСведений.CW_ПраваДоступаДляСтатейДДС КАК CW_ПраваДоступаДляСтатейДДС
	               	|ГДЕ
	               	|	CW_ПраваДоступаДляСтатейДДС.ГруппаПользователя = &ГруппаПользователя";
	
	Запрос.УстановитьПараметр("ГруппаПользователя", ГруппаПользователя);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("СтатьяДДС");
КонецФункции

Функция ИспользованиеСтатейДДС(ГруппаПользователя, ВидДвижения=Неопределено) Экспорт 
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_СтатьиДДС.Ссылка КАК Ссылка
	|ИЗ
	|	РегистрСведений.CW_ПраваДоступаДляСтатейДДС КАК CW_ПраваДоступаДляСтатейДДС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.CW_СтатьиДДС КАК CW_СтатьиДДС
	|		ПО CW_ПраваДоступаДляСтатейДДС.СтатьяДДС = CW_СтатьиДДС.Ссылка
	|ГДЕ
	|	CW_ПраваДоступаДляСтатейДДС.ГруппаПользователя = &ГруппаПользователя
	|	И CW_ПраваДоступаДляСтатейДДС.Использование";
	
	Если ВидДвижения <> Неопределено Тогда
		Запрос.Текст = Запрос.Текст  + " 
		|	И CW_СтатьиДДС.ВидДвижения = &ВидДвижения";
	КонецЕсли;	
	
	Запрос.Текст = Запрос.Текст  +  "
	|	И CW_СтатьиДДС.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ГруппаПользователя", ГруппаПользователя);
	Запрос.УстановитьПараметр("ВидДвижения", ВидДвижения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьвсеСтатьиДДС(ВидДвижения=Неопределено) Экспорт 
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_СтатьиДДС.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_СтатьиДДС КАК CW_СтатьиДДС
	               |ГДЕ
	               |	CW_СтатьиДДС.ПометкаУдаления = ЛОЖЬ";
	
	Если ВидДвижения <> Неопределено Тогда
		Запрос.Текст = Запрос.Текст  + " 
		|	И CW_СтатьиДДС.ВидДвижения = &ВидДвижения";
	КонецЕсли;	
	
	Запрос.УстановитьПараметр("ВидДвижения", ВидДвижения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции
	
	
Функция ИспользованиеСтатьиДДС(ГруппаПользователя,СтатьяДДС) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	CW_ПраваДоступаДляСтатейДДС.Использование КАК Использование
		|ИЗ
		|	РегистрСведений.CW_ПраваДоступаДляСтатейДДС КАК CW_ПраваДоступаДляСтатейДДС
		|ГДЕ
		|	CW_ПраваДоступаДляСтатейДДС.ГруппаПользователя = &ГруппаПользователя
		|	И CW_ПраваДоступаДляСтатейДДС.СтатьяДДС = &СтатьяДДС";
	Запрос.УстановитьПараметр("ГруппаПользователя", ГруппаПользователя);
	Запрос.УстановитьПараметр("СтатьяДДС", СтатьяДДС);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Использование
	КонецЕсли; 
КонецФункции

Функция ПредставлениеПериодаДДС(Период,Детализация,Язык) Экспорт
	Если Детализация = "День" Тогда
		Возврат Формат(Период,"ДФ=dd.MM.yyyy")
	ИначеЕсли Детализация = "Неделя" Тогда
		Возврат "(" + НеделяГода(Период) + ")" + " " + Формат(Период,"ДФ=MM.yyyy");
	ИначеЕсли Детализация = "Квартал" Тогда
		Возврат Формат(Период,"ДФ=к") + ?(Язык = Справочники.CW_Языки.ru," кв. "," qr. ") + Формат(Период,"ДФ=yyyy");
	ИначеЕсли Детализация = "Месяц" Тогда
		Возврат Формат(Период,"ДФ=MM.yyyy")
	ИначеЕсли Детализация = "Год" Тогда
		Возврат Формат(Период,"ДФ=yyyy");
	КонецЕсли; 
КонецФункции
